In [2]:
import pandas as pd

In [8]:
df_Athelete = pd.read_excel("Data/Athletes.xlsx")

In [9]:
df_Athelete.shape

(11085, 3)

In [10]:
df_Athelete.describe()

             Name                       NOC Discipline
count       11085                     11085      11085
unique      11062                       206         46
top     CHEN Yang  United States of America  Athletics
freq            2                       615       2068

In [11]:
df_Teams = pd.read_excel("Data/Teams.xlsx")

In [13]:
df_Teams.shape

(743, 4)

In [15]:
df_Teams.describe()

         Name Discipline    NOC Event
count     743        743    743   743
unique    146         20     84    36
top     Japan   Swimming  Japan   Men
freq       45        113     48   120

In [16]:
df__EntriesGender =pd.read_excel("Data/EntriesGender.xlsx")

In [17]:
df__EntriesGender.shape

(46, 4)

In [18]:
df__EntriesGender.describe()

           Female         Male       Total
count   46.000000    46.000000    46.00000
mean   118.086957   127.913043   246.00000
std    147.169717   166.900746   312.46134
min     10.000000     0.000000    19.00000
25%     42.750000    40.250000    85.50000
50%     90.000000    97.500000   190.00000
75%    138.750000   149.750000   288.75000
max    969.000000  1072.000000  2041.00000

In [24]:
df_Medals =pd.read_excel("Data/Medals.xlsx")

c:\Users\44776\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [25]:
df_Medals.shape

(93, 7)

In [26]:
df_Medals.describe()

            Rank       Gold     Silver     Bronze       Total  Rank by Total
count  93.000000  93.000000  93.000000  93.000000   93.000000      93.000000
mean   46.333333   3.655914   3.634409   4.322581   11.612903      43.494624
std    26.219116   7.022471   6.626339   6.210372   19.091332      24.171769
min     1.000000   0.000000   0.000000   0.000000    1.000000       1.000000
25%    24.000000   0.000000   0.000000   1.000000    2.000000      23.000000
50%    46.000000   1.000000   1.000000   2.000000    4.000000      47.000000
75%    70.000000   3.000000   4.000000   5.000000   11.000000      66.000000
max    86.000000  39.000000  41.000000  33.000000  113.000000      77.000000

In [28]:
df_Medals['Team/NOC'].describe()

count                           93
unique                          93
top       United States of America
freq                             1
Name: Team/NOC, dtype: object

In [27]:
df_Medals.head()

,Rank,Team/NOC,Gold,Silver,Bronze,Total,Rank by Total
0,1,United States of America,39,41,33,113,1
1,2,People's Republic of China,38,32,18,88,2
2,3,Japan,27,14,17,58,5
3,4,Great Britain,22,21,22,65,4
4,5,ROC,20,28,23,71,3

In [29]:
df_Coaches =pd.read_excel("Data/Coaches.xlsx")

c:\Users\44776\anaconda3\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

In [30]:
df_Coaches.shape

(394, 4)

In [31]:
df_Coaches.describe()

                         Name    NOC  Discipline Event
count                     394    394         394   249
unique                    381     61           9     6
top     REQUENA PERICAS Judit  Japan  Basketball   Men
freq                        2     35          74    94